Hi @fmunozmiranda. I enabled the auto import setting in the provider and added the second resource block with the same AD domain settings with the added adGroup attributes. When I run in, the AD join point is created, but I get the following error when it tries to run the second resource block to add the groups.

**Error**
```
│ Error: Failure when executing CreateActiveDirectory
│ 
│   with ciscoise_active_directory.tui-ad-groups,
│   on ad_join.tf line 62, in resource "ciscoise_active_directory" "tui-ad-groups":
│   62: resource "ciscoise_active_directory" "tui-ad-groups" {
│ 
│ error with operation CreateActiveDirectory
│ {
│   "ERSResponse" : {
│     "operation" : "POST-create-activedirectory",
│     "messages" : [ {
│       "title" : "com.cisco.epm.pap.api.exceptions.TransactionFailureException: TransactionFailureException~Failed to creation of Resource Name: NAC Group:NAC:DictionaryBucket:TUI-AD",
│       "type" : "ERROR",
│       "code" : "CRUD operation exception"
│     } ],
│     "link" : {
│       "rel" : "related",
│       "href" : "https://192.168.222.54:9060/ers/config/activedirectory",
│       "type" : "application/xml"
│     }
│   }
│ }
```

**Code**
```
resource "ciscoise_active_directory" "tui-ad" {
  provider = ciscoise.ise31-2
  parameters {

    ad_attributes {

      #attributes {}
    }
    ad_scopes_names = "Default_Scope"
    adgroups {

      #groups {}
    }
    description              = ""
    domain                   = var.domain_name
    name                     = var.join_point_name
  }
}

resource "ciscoise_active_directory_join_domain_with_all_nodes" "tui-ad" {
  provider = ciscoise.ise31-2
  lifecycle {
    create_before_destroy = true
  }
  parameters {
    id = ciscoise_active_directory.tui-ad.parameters[0].id
    additional_data {

      name  = "username"
      value = var.ad_admin_name
    }
    additional_data {

      name  = "password"
      value = var.ise-password
    }
  }
}

resource "ciscoise_active_directory" "tui-ad-groups" {
  provider = ciscoise.ise31-2
  parameters {

    ad_attributes {

      #attributes {}
    }
    ad_scopes_names = "Default_Scope"
    adgroups {

      groups {
        name = "domain.com/Users/Domain Computers"
        sid  = "S-1-5-21-3064845550-2309088537-4239914413-515"
        type = "GLOBAL"
       }
    }
    description              = ""
    domain                   = var.domain_name
    name                     = var.join_point_name
  }
}
```

If I do the run again immediately (without changes), it appears to complete but the group is not actually added in ISE.
```
ciscoise_active_directory.tui-ad: Refreshing state... [id=id:=252862b0-4ffc-11ed-beb0-56d4acca1b2a\name:=TUI-AD]
ciscoise_active_directory_join_domain_with_all_nodes.tui-ad: Refreshing state... [id=1666217989]

Terraform used the selected providers to generate the following execution plan. Resource actions
are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # ciscoise_active_directory.tui-ad-groups will be created
  + resource "ciscoise_active_directory" "tui-ad-groups" {
      + id           = (known after apply)
      + item         = (known after apply)
      + last_updated = (known after apply)

      + parameters {
          + ad_scopes_names            = "Default_Scope"
          + description                = ""
          + domain                     = "trappedunderise.com"
          + enable_domain_allowed_list = (known after apply)
          + enable_domain_white_list   = (known after apply)
          + id                         = (known after apply)
          + link                       = (known after apply)
          + name                       = (sensitive)

          + ad_attributes {
            }

          + adgroups {
              + groups {
                  + name = "domain.com/Users/Domain Computers"
                  + sid  = "S-1-5-21-3064845550-2309088537-4239914413-515"
                  + type = "GLOBAL"
                }
            }
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.
ciscoise_active_directory.tui-ad-groups: Creating...
ciscoise_active_directory.tui-ad-groups: Creation complete after 1s [id=id:=252862b0-4ffc-11ed-beb0-56d4acca1b2a\name:=TUI-AD]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.
```

Doing this also causes an issue when I execute a destroy...
```
│ Error: Failure when executing DeleteActiveDirectoryByID
│ 
│ error with operation DeleteActiveDirectoryById
│ {
│   "ERSResponse" : {
│     "operation" : "DELETE-delete-activedirectory",
│     "messages" : [ {
│       "title" : "com.cisco.cpm.nsf.api.exceptions.NSFEntityDeleteFailed: com.cisco.cpm.nsf.api.exceptions.NSFEntityDeleteFailed: java.rmi.RemoteException: Resource 'NAC Group:NAC:TUI-AD' dosen't exists.",
│       "type" : "ERROR",
│       "code" : "CRUD operation exception"
│     } ],
│     "link" : {
│       "rel" : "related",
│       "href" : "https://192.168.222.54:9060/ers/config/activedirectory/252862b0-4ffc-11ed-beb0-56d4acca1b2a",
│       "type" : "application/xml"
│     }
│   }
│ }
```